app/Http/Controllers/Api/AuthController.php

select * from `users` where `email` = 'admin@example.com' limit 1
---
    public function login(Request $request){
        $request->validate([
            'email' => 'required|email',
            'password' => 'required',
//            'device_name' => 'required',
        ]);

     $user = User::where('email', $request->email)->first();